In [1]:
import pandas as pd

#### DataFrame
Un DataFrame representa una tabla rectangular de datos y contiene una colección ordenada
y nombrada de columnas, cada una de las cuales puede ser un tipo de valor diferente
(numérico, cadena, booleano, etc.).

In [9]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
"year": [2000, 2001, 2002, 2001, 2002, 2003],
"pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [10]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [11]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [12]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [13]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [14]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [15]:
frame2
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [16]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [17]:
frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [18]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [25]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [26]:
del frame2["eastern"]
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [27]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [33]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 1.3}}

In [34]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     1.3

In [35]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   1.3

In [36]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     1.3
2003   NaN     NaN

In [37]:
pdata = {"Ohio": frame3["Ohio"][:-1],"Nevada": frame3["Nevada"][:2]}
# frame3["Ohio"][:-1]: Extrae todos los valores de la columna “Ohio”
# excepto el último valor.
# frame3["Nevada"][:2]:Extrae los primeros dos valores de la columna “Nevada”
# en el DataFrame frame3.
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64,
 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [38]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [39]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     1.3

In [40]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 1.3]])

In [41]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

In [43]:
import numpy as np
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
obj

a    0
b    1
c    2
dtype: int32

In [44]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [45]:
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int32')

In [46]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [47]:
obj2.index is labels

True

In [48]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     1.3

In [49]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [50]:
"Ohio" in frame3.columns

True

In [51]:
2003 in frame3.index

False

In [52]:
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [53]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [54]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [55]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [56]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [59]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=["a", "c", "d"],columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [60]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [61]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [62]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [63]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [64]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [65]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [66]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [67]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=["Ohio", "Colorado", "Utah", "New York"],
columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [68]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [70]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [71]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

#### OTRO EJEMPLO

In [72]:
import pandas as pd

# Crear el DataFrame inicial con los países europeos mencionados
data = {
    'País': ['Austria', 'Bélgica', 'Chipre', 'Dinamarca', 'Francia', 'Eslovenia', 'Irlanda'],
    'Población': [8.9, 11.5, 1.2, 5.8, 67.1, 2.1, 4.9],  # en millones
    'Área': [83.9, 30.5, 9.3, 42.9, 551.7, 20.3, 70.3],  # en miles de km^2
    'Capital': ['Viena', 'Bruselas', 'Nicosia', 'Copenhague', 'París', 'Liubliana', 'Dublín']
}

df = pd.DataFrame(data)
print(df)

        País  Población   Área     Capital
0    Austria        8.9   83.9       Viena
1    Bélgica       11.5   30.5    Bruselas
2     Chipre        1.2    9.3     Nicosia
3  Dinamarca        5.8   42.9  Copenhague
4    Francia       67.1  551.7       París
5  Eslovenia        2.1   20.3   Liubliana
6    Irlanda        4.9   70.3      Dublín

In [73]:
print(df)

        País  Población   Área     Capital
0    Austria        8.9   83.9       Viena
1    Bélgica       11.5   30.5    Bruselas
2     Chipre        1.2    9.3     Nicosia
3  Dinamarca        5.8   42.9  Copenhague
4    Francia       67.1  551.7       París
5  Eslovenia        2.1   20.3   Liubliana
6    Irlanda        4.9   70.3      Dublín

In [74]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   País       7 non-null      object
 1   Población  7 non-null      float64
 2   Área       7 non-null      float64
 3   Capital    7 non-null      object
dtypes: float64(2), object(2)
memory usage: 356.0+ bytes
None

In [75]:
print(df.describe())

       Población        Área
count    7.00000    7.000000
mean    14.50000  115.557143
std     23.47204  194.143099
min      1.20000    9.300000
25%      3.50000   25.400000
50%      5.80000   42.900000
75%     10.20000   77.100000
max     67.10000  551.700000

In [76]:
print(df['Población'])

0     8.9
1    11.5
2     1.2
3     5.8
4    67.1
5     2.1
6     4.9
Name: Población, dtype: float64

In [77]:
print(df[df['Población'] > 5])

        País  Población   Área     Capital
0    Austria        8.9   83.9       Viena
1    Bélgica       11.5   30.5    Bruselas
3  Dinamarca        5.8   42.9  Copenhague
4    Francia       67.1  551.7       París

In [78]:
df['Densidad'] = df['Población'] * 1000 / df['Área']  # población en millones y área en miles de km^2
print(df)

        País  Población   Área     Capital    Densidad
0    Austria        8.9   83.9       Viena  106.078665
1    Bélgica       11.5   30.5    Bruselas  377.049180
2     Chipre        1.2    9.3     Nicosia  129.032258
3  Dinamarca        5.8   42.9  Copenhague  135.198135
4    Francia       67.1  551.7       París  121.624071
5  Eslovenia        2.1   20.3   Liubliana  103.448276
6    Irlanda        4.9   70.3      Dublín   69.701280

In [79]:
df_sorted = df.sort_values(by='Población', ascending=False)
print(df_sorted)

        País  Población   Área     Capital    Densidad
4    Francia       67.1  551.7       París  121.624071
1    Bélgica       11.5   30.5    Bruselas  377.049180
0    Austria        8.9   83.9       Viena  106.078665
3  Dinamarca        5.8   42.9  Copenhague  135.198135
6    Irlanda        4.9   70.3      Dublín   69.701280
5  Eslovenia        2.1   20.3   Liubliana  103.448276
2     Chipre        1.2    9.3     Nicosia  129.032258

In [80]:
print(df[['País', 'Capital']])

        País     Capital
0    Austria       Viena
1    Bélgica    Bruselas
2     Chipre     Nicosia
3  Dinamarca  Copenhague
4    Francia       París
5  Eslovenia   Liubliana
6    Irlanda      Dublín